# Usage, run: $ brew bundle #

# Screen customisation
tap 'FelixKratz/formulae'
brew 'borders'
tap 'nikitabobko/tap'
cask 'aerospace'

# Keyboard Remapper
tap 'yqrashawn/goku'
brew 'goku'
cask 'karabiner-elements'

# Library Management
brew 'asdf'
tap 'coursier/formulas'
brew 'coursier'

# CLI Essentials
brew 'git'
brew 'fzf'
brew 'ripgrep'
brew 'jq'
brew 'poppler'
brew 'starship'
brew 'zoxide'
brew 'eza'
brew 'yazi'
brew 'tmux'
brew 'tpm'
brew 'fastfetch'
brew 'lazygit'
brew 'lazydocker'

# shell
brew 'fish'

# Development
cask 'postman'
cask 'ghostty'
cask 'orbstack'

# Agoda essentials
tap 'devops/tap'
brew 'devstack'
tap 'metalbear-co/mirrord'
brew 'mirrord'
cask 'jetbrains-toolbox'

# Productivity
cask 'raycast'
cask 'shottr'
cask '1password'
cask '1password-cli'
cask 'lookaway'
cask 'hiddenbar'
cask 'spotify'
cask 'appcleaner'
cask 'raindropio'
cask 'zen'
